# external-sort


## Описание решения

Алгоритм сортировки представляет собой вариацию [External Merge Sort](https://en.wikipedia.org/wiki/External_sorting).

Реализация учитывает то, что число элементов $N$ может не делиться нацело на число элементов, доступных для записи в оперативную память $N_M$.

Алгоритм делится на несколько этапов:

- Сортировка данных блоками длиной $N_M$. Количество блоков это количество временных лент $k = \frac{N}{N_M}$.

- [Подсчет](https://www.desmos.com/calculator/jvteixciwv) оптимального значения длины блока записи $m$.

- Из $k$ лент записываем блок длиной $m$. В конец дописываем остаток $R$.

- Сортировка блока памяти длиной $km + R$. Запись блока длиной $k$ в выходную ленту. На место выведенных данных из каждой ленты снимается по одному элементу. Нужно повторять эти шаги, пока временные ленты не кончатся (это произойдет одновременно).

- Запись оставшихся данных в выходную ленту.


## Сборка

Для сборки проекта выполните файл build-test.sh. Он соберет решение в build/external-sort. После сборки этот скрипт запустит тесты.

```
chmod +x build-test.sh
./build-test.sh
```

В build копируется пример конфигурации (tape.config) и тестовый массив из 10000 элементов (10000nums), чтобы можно было проверить работу программы:

```
cd build
./external-sort 10000nums output
```


## Задачи

- Интерфейс для работы с типом лента: lib/ITape.h

- Класс, реализующий этот интерфейс: src/FileTape.h

- Класс сортировки с входной ленты на выходную: src/TapeSort.h
